In [1]:
import pandas as pd

In [2]:
# Series - это вектор. Одномерный массив

s1 = pd.Series([1, 2, 3, 4, 5])
print (s1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
s2 = pd.Series([1, 2, 3, 4, 5], index = ['a', 'b', 'c', 'd', 'e'])

In [4]:
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
import numpy as np
ndarr = np.array([1,2,3,4,5])
print (type(ndarr))
s3 = pd.Series (ndarr, ['a', 'b', 'c', 'd', 'e'])
print(s3)

<class 'numpy.ndarray'>
a    1
b    2
c    3
d    4
e    5
dtype: int32

In [8]:
dct = {'a':1, 'b':2, 'c':3}
s4 = pd.Series(dct)

In [9]:
s4

a    1
b    2
c    3
dtype: int64

In [10]:
s6 = pd.Series([1, 2, 3, 4, 5], index = ['a', 'b', 'c', 'd', 'e'])
print (s6)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
print(s6['d'])
print(s6[3])

4
4

In [16]:
s6[0:2]

a    1
b    2
dtype: int64

In [17]:
s6[s6 >= 3]

c    3
d    4
e    5
dtype: int64

In [18]:
s6[lambda x: x**3 >= 3]

b    2
c    3
d    4
e    5
dtype: int64

In [19]:
s7 = pd.Series([10, 20, 30, 40, 50], index = ['a', 'b', 'c', 'd', 'e'])

In [20]:
s6+s7

a    11
b    22
c    33
d    44
e    55
dtype: int64

In [21]:
s6*3

a     3
b     6
c     9
d    12
e    15
dtype: int64

In [ ]:
# DataFrame - он состоит из Series'ов

In [22]:
d = {'price': pd.Series([1 ,2 ,3], index=['v1', 'v2', 'v3']),
     'count': pd.Series([10, 12, 7 , 5 , 11], index=['v1', 'v2', 'v3', 'v4', 'v5'])
    }

In [23]:
df1 = pd.DataFrame(d)

In [25]:
df1

    price  count
v1    1.0     10
v2    2.0     12
v3    3.0      7
v4    NaN      5
v5    NaN     11

In [26]:
d2 = {'price': np.array([1,2,3]),
      'count': np.array([10,12,7])
     }
df2 = pd.DataFrame(d2, index=['v1','v2','v3'])

In [29]:
print(df2)
print(df2.index)
print(df2.columns)

    price  count
v1      1     10
v2      2     12
v3      3      7
Index(['v1', 'v2', 'v3'], dtype='object')
Index(['price', 'count'], dtype='object')

In [30]:
d3 = [{'price': 3, 'count' :8}, {'price': 4, 'count': 11}]
df3 = pd.DataFrame(d3)
print(df3)

   count  price
0      8      3
1     11      4

In [31]:
df3['price']

0    3
1    4
Name: price, dtype: int64

In [32]:
df3.loc[1]

count    11
price     4
Name: 1, dtype: int64

In [33]:
d = {'price': np.array([1,2,3]),
      'count': np.array([10,20,30])
     }
df = pd.DataFrame(d2, index=['a','b','c'])

In [34]:
df

   price  count
a      1     10
b      2     12
c      3      7

In [35]:
print (df['count'])

a    10
b    12
c     7
Name: count, dtype: int32

In [36]:
print(df.loc['a'])

price     1
count    10
Name: a, dtype: int32

In [37]:
print(df.iloc[1])

price     2
count    12
Name: b, dtype: int32

In [38]:
print(df[0:2])

   price  count
a      1     10
b      2     12

In [42]:
df[df['count'] >= 10]

   price  count
a      1     10
b      2     12

In [43]:
df_new = df[['count', 'price']] # внтури указывается список, по которому будем фильтровать

In [44]:
df_new

   count  price
a     10      1
b     12      2
c      7      3

In [45]:
df['a':'b']

   price  count
a      1     10
b      2     12

In [47]:
df[lambda x: x['count'] > 10]

   price  count
b      2     12

In [49]:
df[(df['price'] >= 2) & (df['count'] >= 10)]

   price  count
b      2     12

In [50]:
df[df.price >= 2]

   price  count
b      2     12
c      3      7

In [51]:
s = pd.Series([10, 20, 30, 40, 50], ['a', 'b', 'c', 'd', 'e'])
s.sample()

e    50
dtype: int64

In [55]:
s.sample() # выбор случайной несмещенной выборки - одного значения - с равной вероятностью
s.sample(n=3) # выбор случайной несмещенной выборки

d    40
b    20
c    30
dtype: int64

In [57]:
s.sample(frac=0.3) # выбор случайной несмещенной выборки - процент , тут берем 30%

d    40
c    30
dtype: int64

In [58]:
w = [0.1, 0.2, 0.5, 0.1, 0.1] # веса, в сумме должно быть 1 
s.sample(n = 3, weights=w)

d    40
b    20
a    10
dtype: int64

In [59]:
df.sample()

   price  count
c      3      7

In [60]:
df.sample(n=2)

   price  count
b      2     12
c      3      7

In [65]:
df.sample(frac=0.4)

   price  count
b      2     12

In [66]:
s

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [67]:
s['f'] = 60

In [68]:
s

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [69]:
s[s==10]

a    10
dtype: int64

In [70]:
s[(s>=30) & (s<50)]

c    30
d    40
dtype: int64

In [71]:
s.isin([10, 20])

a     True
b     True
c    False
d    False
e    False
f    False
dtype: bool

In [72]:
s[s.isin([10, 20])]

a    10
b    20
dtype: int64

In [73]:
s

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [74]:
df = pd.read_csv('data.csv')

In [75]:
df

   price  count  percent
0      1     10      NaN
1      2     20     51.0
2      3     30      NaN

In [76]:
df.loc[3] = {'price': 4, 'count': None, 'percent': 26.3}

In [77]:
df

   price  count  percent
0    1.0   10.0      NaN
1    2.0   20.0     51.0
2    3.0   30.0      NaN
3    4.0    NaN     26.3

In [78]:
pd.isnull(df)

   price  count  percent
0  False  False     True
1  False  False    False
2  False  False     True
3  False   True    False

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 3 columns):
price      4 non-null float64
count      3 non-null float64
percent    2 non-null float64
dtypes: float64(3)
memory usage: 128.0 bytes

In [80]:
df.isnull().sum()

price      0
count      1
percent    2
dtype: int64

In [81]:
df.fillna(0) # не inplace , по умолчанию он возвращает df

   price  count  percent
0    1.0   10.0      0.0
1    2.0   20.0     51.0
2    3.0   30.0      0.0
3    4.0    0.0     26.3

In [85]:
df.fillna(df.mean()) # заполняет средним ПО КОЛОНКЕ значением

   price  count  percent
0    1.0   10.0    38.65
1    2.0   20.0    51.00
2    3.0   30.0    38.65
3    4.0   20.0    26.30

In [86]:
df.dropna()

   price  count  percent
1    2.0   20.0     51.0

In [87]:
user_usage = pd.read_csv('user_usage.csv')

In [88]:
user_usage.head()

   outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id
0                    21.97                    4.82     1557.33   22787
1                  1710.08                  136.88     7267.55   22788
2                  1710.08                  136.88     7267.55   22789
3                    94.46                   35.17      519.12   22790
4                    71.59                   79.26     1557.33   22792

In [89]:
user_device = pd.read_csv('user_device.csv')

In [90]:
user_device.head()

   use_id  user_id platform  platform_version     device  use_type_id
0   22782    26980      ios              10.2  iPhone7,2            2
1   22783    29628  android               6.0    Nexus 5            3
2   22784    28473  android               5.1   SM-G903F            1
3   22785    15200      ios              10.2  iPhone7,2            3
4   22786    28239  android               6.0  ONE E1003            1

In [91]:
devices = pd.read_csv('android_devices.csv')

In [92]:
devices.head()

  Retail Branding Marketing Name    Device                      Model
0             NaN            NaN    AD681H  Smartfren Andromax AD681H
1             NaN            NaN     FJL21                      FJL21
2             NaN            NaN       T31              Panasonic T31
3             NaN            NaN  hws7721g         MediaPad 7 Youth 2
4              3Q        OC1020A   OC1020A                    OC1020A

In [96]:
result = pd.merge(user_usage, 
                  user_device[['use_id', 'platform', 'device']],
                 on = 'use_id')

result.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F

In [97]:
user_usage['use_id'].isin(user_device['use_id']).value_counts() # сколько use_id из одной таблицы во второй таблице

True     159
False     81
Name: use_id, dtype: int64

In [98]:
user_device['platform'].value_counts()

android    184
ios         88
Name: platform, dtype: int64

In [102]:
result = pd.merge(
    user_usage, 
    user_device[['use_id', 'platform', 'device']],
    on = 'use_id',
    how = 'left'
)
result.head(10)

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F
5,71.59,79.26,1557.33,22793,android,SM-G361F
6,71.59,79.26,519.12,22794,android,SM-G361F
7,71.59,79.26,519.12,22795,android,SM-G361F
8,30.92,22.77,3114.67,22799,android,ONEPLUS A3003
9,69.80,14.70,25955.55,22801,android,GT-I9505

In [104]:
result.shape

(240, 6)

In [106]:
result = pd.merge(
    user_usage, 
    user_device[['use_id', 'platform', 'device']],
    on = 'use_id',
    how = 'right'
)
result.tail(10)

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
262,NaN,NaN,NaN,23035,ios,"iPhone7,2"
263,NaN,NaN,NaN,23037,ios,"iPhone7,1"
264,NaN,NaN,NaN,23038,ios,"iPhone7,1"
265,NaN,NaN,NaN,23042,android,SM-G900F
266,NaN,NaN,NaN,23045,ios,"iPhone7,1"
267,NaN,NaN,NaN,23047,ios,"iPhone7,1"
268,NaN,NaN,NaN,23048,android,ONEPLUS A3003
269,NaN,NaN,NaN,23050,ios,"iPhone7,2"
270,NaN,NaN,NaN,23051,ios,"iPhone7,2"
271,NaN,NaN,NaN,23052,ios,"iPhone8,4"

In [107]:
result.shape

(272, 6)

In [108]:
result = pd.merge(
    user_usage, 
    user_device[['use_id', 'platform', 'device']],
    on = 'use_id',
    how = 'outer',
    indicator=True
)

result.iloc[[0,1,200,201,350,351]]

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device,_merge
0,21.97,4.82,1557.33,22787,android,GT-I9505,both
1,1710.08,136.88,7267.55,22788,android,SM-G930F,both
200,28.79,29.42,3114.67,23988,NaN,NaN,left_only
201,616.56,99.85,5414.14,24006,NaN,NaN,left_only
350,NaN,NaN,NaN,23050,ios,"iPhone7,2",right_only
351,NaN,NaN,NaN,23051,ios,"iPhone7,2",right_only

In [113]:
data_url = 'http://vincentarelbundock.github.io/Rdatasets/csv/carData/Salaries.csv'

In [114]:
df = pd.read_csv(data_url, index_col=0)
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
1      Prof          B             19           18  Male  139750
2      Prof          B             20           16  Male  173200
3  AsstProf          B              4            3  Male   79750
4      Prof          B             45           39  Male  115000
5      Prof          B             40           41  Male  141500

In [115]:
df_rank = df.groupby('rank')

In [117]:
df['rank'].value_counts()

Prof         266
AsstProf      67
AssocProf     64
Name: rank, dtype: int64

In [118]:
df_rank.groups

{'AssocProf': Int64Index([  6,  11,  25,  40,  42,  55,  56,  58,  59,  61,  64,  66,  90,
              92,  93,  97, 105, 107, 108, 109, 112, 124, 131, 133, 139, 141,
             142, 154, 157, 159, 163, 169, 175, 177, 178, 183, 187, 189, 194,
             195, 196, 215, 218, 219, 223, 228, 232, 256, 258, 261, 285, 286,
             294, 300, 317, 322, 323, 329, 335, 364, 368, 371, 380, 383],
            dtype='int64'),
 'AsstProf': Int64Index([  3,  12,  13,  14,  28,  29,  32,  34,  35,  36,  38,  50,  53,
              60,  62,  65,  76,  79,  80,  84,  88,  91,  96, 113, 119, 120,
             128, 130, 134, 144, 147, 150, 152, 155, 158, 161, 164, 165, 171,
             180, 197, 198, 201, 209, 211, 227, 235, 238, 241, 254, 259, 273,
             274, 275, 288, 290, 307, 309, 316, 326, 349, 355, 360, 377, 378,
             381, 397],
            dtype='int64'),
 'Prof': Int64Index([  1,   2,   4,   5,   7,   8,   9,  10,  15,  16,
             ...
             387, 388, 389, 390, 391, 392, 393, 394, 395, 396],
            dtype='int64', length=266)}

In [119]:
df_rank.get_group('AsstProf').head()

        rank discipline  yrs.since.phd  yrs.service   sex  salary
3   AsstProf          B              4            3  Male   79750
12  AsstProf          B              7            2  Male   79800
13  AsstProf          B              1            1  Male   77700
14  AsstProf          B              2            0  Male   78000
28  AsstProf          B              5            3  Male   82379

In [120]:
df_rank.size()

rank
AssocProf     64
AsstProf      67
Prof         266
dtype: int64

In [121]:
df_rank.count()

           discipline  yrs.since.phd  yrs.service  sex  salary
rank
AssocProf          64             64           64   64      64
AsstProf           67             67           67   67      67
Prof              266            266          266  266     266

In [122]:
df_rank.nunique()

           rank  discipline  yrs.since.phd  yrs.service  sex  salary
rank
AssocProf     1           2             24           21    2      63
AsstProf      1           2             11            7    2      53
Prof          1           2             42           50    2     261

In [125]:
df_rank['salary'].mean().reset_index() # reset_index - сдвигает индекс , без этого индекс будет по rank

        rank         salary
0  AssocProf   93876.437500
1   AsstProf   80775.985075
2       Prof  126772.109023